DataProcessors/ПечатьЯрлыковДляСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ПечатьЯрлыковДляСклада</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерВариантаПечати</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокНаЛисте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтолбцовНаЛисте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СекцииДляПечати</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ячейка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Штрих</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>22</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ШтрихКоды</Name>
			<Comment>В регистре хранятся сведения о штрих-кодах на товары и карточки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВыгружатьВОборудование</Name>
					<Comment>Признак выгрузки ШК в торговое оборудование с памятью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Штрих-код запрещен. Любые действия с этим штрих-кодом запрещены.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ШтрихКод</Name>
					<Comment>Штрих-код товара или карточки</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>22</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект штрих-кода (номенклатура или карточка)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаХранениеШин</v8:Type>
						<v8:Type>cfg:CatalogRef.ЯчейкиХранения</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзвлечениеТоваровИзПроизводства</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияАвтомобиля</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваровВПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуЗаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой установлен данный штрих-код</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЯчейкиХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ЯчейкиХранения</Name>
			<Comment>Места хранения ячеистого склад</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СкладыКомпании</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДлинаЯчейки</Name>
					<Comment>Длина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШиринаЯчейки</Name>
					<Comment>Ширина ячейки в единицах размерности склада-владельца</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаX</Name>
					<Comment>Координата X ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоординатаY</Name>
					<Comment>Координата Y ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уровень</Name>
					<Comment>Координата Z ячейки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветГруппы</Name>
					<Comment>Цвет ячеек, входящих в данную группу, для отображения в карте склада. </Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Недоступна</Name>
					<Comment>Признак доступности (активности ) ячейки. Например, ячейка недоступна, если она сломана, красится и т.д.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтараяЯчейка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Зоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ряд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ряды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стеллаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Стеллажи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Полки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ПечатьЯрлыковДляСклада/Ext/ObjectModule.bsl
//Бондаренко 20151023 ++
Функция НайтиШтрихКод(Ячейка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЯчейкиХранения.Ссылка,
	               |	ШтрихКоды.ШтрихКод
	               |ИЗ
	               |	Справочник.ЯчейкиХранения КАК ЯчейкиХранения
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихКоды КАК ШтрихКоды
	               |		ПО (ШтрихКоды.Объект = ЯчейкиХранения.Ссылка)
	               |ГДЕ
	               //|	ЯчейкиХранения.Владелец = &Владелец	И 
				   |ЯчейкиХранения.ПометкаУдаления = ЛОЖЬ
	               |	И ЯчейкиХранения.Ссылка = &Ссылка";
				   
				  // Запрос.УстановитьПараметр("Владелец",Склад);
				   Запрос.УстановитьПараметр("Ссылка",Ячейка);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() цикл
  		Возврат Результат.ШтрихКод;
	КонецЦикла;	
	
	Возврат "";
	
КонецФункции
//Бондаренко 20151023 --
 

Процедура ПечатьЯрлыков(НомерВар) Экспорт
	Если СекцииДляПечати.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
   	Если НомерВар=1 Тогда
		МакетЯрлыка = ПолучитьМакет("МакетЯрлыка");
	Иначе	
 		МакетЯрлыка = ПолучитьМакет("Макет");
 	КонецЕсли; 
	 
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;

	СтрокаДляВывода = Неопределено;
	
	Сч_Столб = 0;
	Сч = 1;
	
	Для Каждого СтрокаСекции Из СекцииДляПечати Цикл
		//СтрокаДляВывода = Новый ТабличныйДокумент;
		//СтрокаДляВывода.ПолеСверху = 0;
		//СтрокаДляВывода.ПолеСнизу = 0;
		//СтрокаДляВывода.ПолеСлева = 0;
		//СтрокаДляВывода.ПолеСправа = 0;
		
		ОбластьЯрлык = МакетЯрлыка.ПолучитьОбласть("Ярлык|Ярл");
		
		Если НомерВар = 1 Тогда
			ОбластьЯрлык.Параметры.Секция = ПривестиИдентификатор(СтрокаСекции.Ячейка.НомерЯчейки);
			ОбластьЯрлык.Параметры.Полка = ПривестиИдентификатор(СтрокаСекции.Ячейка.Полка.ИдентификаторДляЯрлыка);
			ОбластьЯрлык.Параметры.Стеллаж = ПривестиИдентификатор(СтрокаСекции.Ячейка.Стеллаж.ИдентификаторДляЯрлыка);
			ОбластьЯрлык.Параметры.Ряд = ПривестиИдентификатор(СтрокаСекции.Ячейка.Ряд.ИдентификаторДляЯрлыка);
			ОбластьЯрлык.Параметры.Зона = СтрокаСекции.Ячейка.Зона.ИдентификаторДляЯрлыка; 
			ОбластьЯрлык.Параметры.Склад = СтрокаСекции.Ячейка.Владелец.ИдентификаторДляЯрлыка;
		Иначе	
			ОбластьЯрлык.Параметры.Ячейка = СтрокаСекции.Ячейка;
 		КонецЕсли; 
 		
		//Бондаренко 20151023 ++
		
		//ОбластьЯрлык.РИсунки.ШтрихкодЯрлыка.Объект.ТипКода = 3;
		//ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.Сообщение = СокрЛП(СтрокаСекции.Ячейка.Код);
		//ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.ТекстКода = СокрЛП(СтрокаСекции.Ячейка.Код);
		//ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.ОтображатьТекст = ложь;
		
		ШтрихКод = "";
		ШтрихКод = НайтиШтрихКод(СтрокаСекции.Ячейка);
		
		Сообщить("ШтрихКод = "+ШтрихКод);
		
		ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.ТипКода = 1;
		ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.Сообщение = СокрЛП(ШтрихКод);
		ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.ТекстКода = СокрЛП(ШтрихКод);
		ОбластьЯрлык.Рисунки.ШтрихкодЯрлыка.Объект.ОтображатьТекст = Истина;
		
		
		//Бондаренко 20151023 --

		Если Сч_Столб < СтолбцовНаЛисте Тогда
  			ТабДок.Присоединить(ОбластьЯрлык);
			Сч_Столб = Сч_Столб + 1;
		Иначе
			Если Сч < СтрокНаЛисте Тогда
 				Сч_Столб = 1;
 				Сч = Сч + 1;
			Иначе
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				Сч = 1;
				Сч_Столб = 1;
			КонецЕсли;
			ТабДок.Вывести(ОбластьЯрлык);
		КонецЕсли;	
		
		//Если СЧ = 1 Тогда
		//	СтрокаДляВывода = Новый ТабличныйДокумент;
		//	СтрокаДляВывода.ПроверитьПрисоединение(
		//	СтрокаДляВывода.Вывести(ОбластьЯрлык);
		//ИначеЕсли СЧ <> КоличествоВСтроке Тогда
		//	СтрокаДляВывода.Присоединить(ОбластьЯрлык);
		//ИначеЕсли СЧ = 4 Тогда
		//	СтрокаДляВывода.Присоединить(ОбластьЯрлык);
		//	ТабДок.Вывести(СтрокаДляВывода);
		//	СтрокаДляВывода = Неопределено;
		//	СЧ = 0;
		//КонецЕсли;
		//СЧ = СЧ + 1;
	КонецЦикла;
	//Если СтрокаДляВывода <> Неопределено Тогда
	//	ТабДок.Вывести(СтрокаДляВывода);
	//КонецЕсли;
	
	//Бондаренко 20151118 ++
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
 	ТабДок.АвтоМасштаб=Истина;
  	ТабДок.ПолеСверху=0;
	ТабДок.ПолеСлева=0;
	ТабДок.ПолеСнизу=0;
	ТабДок.ПолеСправа=0;
	ТабДок.ВерхнийКолонтитул.Выводить=Ложь;
	ТабДок.НижнийКолонтитул.Выводить=Ложь;
 	//Бондаренко 20151118 --
	
	ТабДок.Показать();
КонецПроцедуры

Функция ПривестиИдентификатор(Идентификатор)
	Попытка
		Возврат Число(СокрЛП(Идентификатор));
	Исключение
		Возврат СокрЛП(Идентификатор);
	КонецПопытки
КонецФункции

Процедура ЗаполнитьСекции(Показатель) Экспорт
	
	Если ТипЗнч(Показатель) = Тип("Строка") Тогда
		Возврат;
	ИначеЕсли ТипЗнч(Показатель) = Тип("СправочникСсылка.ЯчейкиХранения") Тогда
		Если ЗначениеЗаполнено(Показатель.Зона) Тогда
			СтрокаСекции = СекцииДляПечати.Добавить();
			СтрокаСекции.Ячейка = Показатель;
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		ЗапросЯчеек = Новый Запрос();
		ТекстЗапроса =  "ВЫБРАТЬ
		                |	ЯчейкиХранения.Ссылка КАК Ячейка
		                |ИЗ
		                |	Справочник.ЯчейкиХранения КАК ЯчейкиХранения
		                |ГДЕ
						| %ОтборПоВладельцу% = &Показатель
		                |УПОРЯДОЧИТЬ ПО
		                |	ЯчейкиХранения.Код";
						
		Если ТипЗнч(Показатель) = Тип("СправочникСсылка.Полки") Тогда
			ТекстОтбораПоВладельцу = "ЯчейкиХранения.Полка";
		ИначеЕсли ТипЗнч(Показатель) = Тип("СправочникСсылка.Стеллажи") Тогда
			ТекстОтбораПоВладельцу = "ЯчейкиХранения.Стеллаж";
		ИначеЕсли ТипЗнч(Показатель) = Тип("СправочникСсылка.Ряды") Тогда
			ТекстОтбораПоВладельцу = "ЯчейкиХранения.Ряд";
		ИначеЕсли ТипЗнч(Показатель) = Тип("СправочникСсылка.Зоны") Тогда
			ТекстОтбораПоВладельцу = "ЯчейкиХранения.Зона";
		Иначе
			Возврат;
		КонецЕсли;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"%ОтборПоВладельцу%", ТекстОтбораПоВладельцу);
		ЗапросЯчеек.Текст = ТекстЗапроса;
		ЗапросЯчеек.УстановитьПараметр("Показатель", Показатель);
						
		СекцииДляПечати.Загрузить(ЗапросЯчеек.Выполнить().Выгрузить());
	КонецЕсли;
КонецПроцедуры
